# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rake db:seed (or created alongside the db with db:setup).
#
# Examples:
#
#   cities = City.create([{ name: 'Chicago' }, { name: 'Copenhagen' }])
#   Mayor.create(name: 'Emanuel', city: cities.first)
if false
CharGroup.create([
    {name: 'special'},
    {name: 'apprentice'},
    {name: 'master'},
    {name: 'dweller'},
    {name: 'qwest'},
    {name: 'additional'}
    ])

CharStatus.create([
    {name: 'saved'},
    {name: 'pending'},
    {name: 'reviewing'},
    {name: 'approved'},
    {name: 'active'},
    {name: 'na'},
     ])

Season.create(name: "Зима", description: "Сегодня очень ясно, температура днем +7, вечером останется той же.\r\nТемпература колышется от +2 до -2.\r\nОдевайтесь теплее: северные ветра так и жаждут застать вас врасплох, принося с собой заморозки.\r\nСегодня, как обычно, без осадков. Привыкайте таскать воду из озера К вечеру похолодает с +3 до 0.\r\nСегодня штиль и ярко светит солнце, но не обольщайтесь, теплее от этого всего лишь на пару градусов – до +9. \r\nСегодня довольно облачно, но не рискуйте смотреть на солнце без защитных очков. Средняя температура по области +4. \r\nОй, а сегодня прямо-таки намеки, намеки на осадки, ведь столько облаков... Но, увы, осадков нет, зато температура поднимется до +7\r\nВетра нет, снова нет ветра! И спасения от внезапно появившихся облаков тоже нет. 0 на улице, друзья!\r\nСегодня ночью температура вновь опустится до -5. Не забудьте потеплее укрыться.\r\nВнимание! Северные ветра снова атакуют, принося с собой очередное понижение температуры. К ночи ожидается до -3.\r\nСегодняшний день принесет нам много солнца и тепла. Радуйтесь, почти + 9.\r\nИ снова безветренно, штиль и +4.\r\nЛюбителям позагорать и поплавать в ледяных водах нашего озера: нулевая температура. Есть ли резон лезть в воду греться?\r\nСегодня у нас снова нет ветра, нет осадков, на небе ни тучки, но солнце все еще не греет – всего + 7.\r\nПасмурная погода, без осадков, + 10.\r\nОблака задерживают тепло, температура сегодня обещает быть около +12.\r\nНочью холодно, западные ветра принесли резкое похолодание - +2.\r\nВосточный ветер принес к нам немного тепла посреди зимы. Радуемся, аж +5.\r\nОсадков все также не наблюдается. Продолжаем работать ручками. Всего +7.\r\nМолимся Будде, или кому вы там поклоняетесь. Сегодня тепло, + 9, и возможны осадки.")

Season.create(name: "Весна", description: "Сегодня пасмурно с просветами. Днем +11, вечером температура останется такой же. Осадков нет.\r\nСегодня пасмурно. Днем +13, к вечеру похолодает до +7. Ночью возможен снег.\r\nСегодня пасмурно. Днем +8, к вечеру похолодает до +6. Возможен снег.\r\nСегодня пасмурно с прояснениями. Днем +11, к вечеру немного потеплеет до +12 и небо станет ясным.\r\nСегодня небо затянуто тучами, идет снег. И днем, и к вечеру температура воздуха будет +4. Но ночью поднимется ветер, лучше идти спать вовремя. \r\nСегодня днем возможна гроза, температура воздуха +12, но к вечеру небо прояснится и потеплеет до +14.\r\nСегодня днем будет тепло, +21, к вечеру похолодает на пару градусов. Небо немного облачное, но эти облака все равно не скроют солнечные лучи.\r\nВесь день небо будет чистым, днем + 21, к вечеру потеплеет до +23. Небольшой ветер поднимется лишь к вечеру.\r\nСолнечный день и не менее солнечный вечер, температура +22-+24, возможен небольшой ветер.\r\nВесь день погода будет солнечной, а ночь – звездной и лунной. Не жарко, +15 днем, к вечеру +16.\r\nОблачно с прояснениями, и, хотя воздух нагреется до +14, возможен внезапный снег. К вечеру похолодает до +10.\r\nДнем пасмурно, но довольно тепло, +18. А вот к вечеру похолодает до +8, возможна гроза.\r\nЯсный солнечный день, с утра +21, к вечеру будет довольно жарко – воздух нагреется до +28.\r\nС самого утра возможна гроза, хотя воздух будет теплым, +19-+20. К вечеру похолодает до +16, небо будет затянуто тучами.\r\nДень будет облачным и теплым, +21. К вечеру температура поднимается до +24, но возможна гроза.\r\nНемного облачный, но безветренный день. Днем +21, к вечеру потеплеет до +24. \r\nДнем довольно прохладно, +14, и возможна гроза. Вечером температура воздуха упадет до +11, продолжится мелкий дождь. \r\nС утра будет +15, небо немного затянуто облаками. Но, несмотря на эти облака, к вечеру станет теплее, до +19\r\nСегодня день будет пасмурным, но без дождя. С утра +15, к вечеру похолодает до +11.\r\nС самого утра +20, солнечно. К вечеру появятся облака, похолодает до +11.")

Season.create(name: 'Лето', description: "Несмотря на то, что сегодня лето, но у нас достаточно пасмурно, но тепло - +25.\r\nОдевайтесь потеплее – к вечеру похолодание, сильный северный ветер и всего +16.\r\nЛюбители поваляться на солнышке, сегодня ваш день! Безоблачно, солнечно, до 28 тепла, но не забывайте о порядках в монастыре.\r\nДень переменная облачность, а к ночи пройдет небольшой дождь. Местами похолодает до + 20.\r\nНет ничего лучше настоящей весенней грозы, особенно летом, днем, когда тепло и светит солнце. Редкое явление на Тибете. \r\nВы не поверите, но сегодня ночью ожидается самая настоящая и полноценная гроза! Готовьте тазики и ведерки для сбора воды!\r\nТемпература днем и ночью в пределах нормы, резких скачков не ожидается – около 23 тепла. \r\nЗахватите зонтик, ожидаются редкие осадки. А еще не забудьте шарфик – всего +18.\r\nСеверный ветер, резкое похолодание до +13.\r\nПеременная облачность, без осадков, около 20 тепла.\r\nЕсли сегодня услышите раскаты грома – не обольщайтесь, ведь осадков не ожидается, зато температура воздуха постепенно снижается и сегодня вряд ли поднимется выше +18.\r\nНа дворе все еще лето, причем очень теплое, только от слишком облачно, чтобы нормально расслабиться на солнышке при 26 тепла.\r\nЗапасайтесь легкими продуктами, складывайте их в корзины и в поля на пикничок, пока земля все еще теплая и нет сильного ветра. \r\nВау, неожиданно, но сегодня безветренно – штиль, - и 25 тепла.\r\nВот он – долгожданный солнечный денек, практически безоблачно и +22.\r\nСильный ветер, похолодание до 14 тепла – одевайтесь теплее.\r\nВ такую погоду, говорят, хороший хозяин на прогулку не выгонит, но есть такое слово как «надо». Противная морось и не больше 17 тепла.\r\nСегодня пасмурно, но пару раз можно будет увидеть солнце из-за серых облаков. Всего +19.\r\nВосточный ветер принесет с собой чистое небо и небольшое потепление – до + 22.\r\nСеверо-Западные ветра окончательно установили контроль над Тибетом, принеся за собой холодную осеннюю погоду.")

Season.create(name: 'Осень', description: "С утра будет облачно, +18, но к вечеру похолодает до +14, возможен дождь.\r\nИ день, и вечер, будут солнечными и ясными, на небе – ни единого облачка. +19-+20 градусов, ветра почти нет.\r\nУтром будет облачно, но к вечеру облака рассеются, обещая нам звездную ночь. Воздух прогреется до +19.\r\nСолнечное утро будет нежарким, +16, а к вечеру небо затянется тучами, похолодает до +14, возможен дождь.\r\nУтром облачно, +19, но к вечеру стихнет легкий ветер, и небо станет ясным, хотя немного похолодает до +17.\r\nВесь день будет пасмурным, но Солнце изредка будет выглядывать из-за облаков. Тепло, +19.\r\nЯсный ветреный день, и такой же вечер, +15-+16\r\nПасмурное теплое утро, +20 градусов, сменится чуть более прохладным, +17 градусов, вечером, но небо станет ясным и чистым, и останется таким на всю ночь.\r\nУтром и днем будет немного облачно, но тепло, +20 градусов. К вечеру облаков станет больше, ветер станет немного слабее и похолодает до +16.\r\nСолнечный и ветреный день. Утром +16, к вечеру похолодает до +13. На небе – ни единого облачка.\r\nУтром холодно и пасмурно, +6, возможен снег. К вечеру похолодает до +5, но осадков уже не будет, хотя небо по-прежнему затянуто облаками.\r\nУтро ветреное и солнечное, +15 градусов. К вечеру ветер стихнет, но похолодает до +10.\r\nУтро и день пасмурные, +8 градусов. Вечером небо прояснится, ветер стихнет, а температура воздуха упадет до +6\r\nДень теплый, безоблачный и безветренный. С утра будет до +21 градуса, к вечеру немножко похолодает до +17\r\nСолнечный день, на небе – ни единого облачка. Днем +8, к вечеру до +6.\r\nЯсный солнечный день, +12 градусов. Легкий ветер стихнет к вечеру, но похолодает до +6, хотя небо по-прежнему останется ясным.\r\nБезветренный день, утром и днем +12, к вечеру на небе появятся редкие облака, температура воздуха упадет до +7\r\nСолнечный день, звездная ночь, ни ветра, ни облаков. Днем температура воздуха достигнет +12 градусов, к вечеру опустится до +8.\r\nЕщё один солнечный прохладный день. Легкий ветер, температура воздуха днем +9, к вечеру опустится до +6.\r\nУтро и день будут безоблачными, +11, но к вечеру появятся довольно густые облака и похолодает до +5. Ветра почти не будет, осадки маловероятны.")

LogType.create([
    {name: 'Пользователи', ancestry: nil},
    {name: 'Персонажи', ancestry: nil},
    {name: 'Доступ', ancestry: '1'},
    {name: 'Аутентификация', ancestry: '1/3'},
    {name: 'Авторизация', ancestry: '1/3'},
    {name: 'Группа доступа', ancestry: '1/3'},
    {name: 'Права модерации', ancestry: '1/3'},
    {name: 'Доступ в разделы', ancestry: '1/3'},
    {name: 'Профиль', ancestry: '1'},
    {name: 'Изменение профиля', ancestry: '1/9'},
    {name: 'Смена пароля', ancestry: '1/9'},
    {name: 'Запрос пароля', ancestry: '1/9'},
    {name: 'Новые анкеты', ancestry: '2'},
    {name: 'Одобрение анкеты', ancestry: '2'},
    {name: 'Делегирование', ancestry: '2'},
    {name: 'Изменение анкеты', ancestry: '2'}
               ])

Level.create([
    {name:"Новичок"},
    {name:"Ученик"},
    {name:"Послушник"},
    {name:"Младший Мастер"},
    {name:"Мастер"},
    {name:"Старший Мастер"},
    {name:"Наставник"}
             ])

Skill.create([
    {name:"Врачевание", skill_type:"magic"},
    {name:"Магия Воды", skill_type:"magic"},
    {name:"Магия Воздуха", skill_type:"magic"},
    {name:"Магия Земли", skill_type:"magic"},
    {name:"Магия Огня", skill_type:"magic"},
    {name:"Ментальная магия", skill_type:"magic"},
    {name:"Офуда", skill_type:"magic"},
    {name:"Превращение", skill_type:"magic"},
    {name:"Прорицание", skill_type:"magic"},
    {name:"Рунная магия", skill_type:"magic"},
    {name:"Телекинез", skill_type:"magic"},
    {name:"Шаманизм", skill_type:"magic"}
             ])

Skill.create([
    {name:"Бо",  skill_type:"phisic"},
    {name:"Бянь",  skill_type:"phisic"},
    {name:"Дзё",  skill_type:"phisic"},
    {name:"Вакидзаси",  skill_type:"phisic"},
    {name:"Знание животных компонентов",  skill_type:"phisic"},
    {name:"Знание трав",  skill_type:"phisic"},
    {name:"Знание камней",  skill_type:"phisic"},
    {name:"Каллиграфия",  skill_type:"phisic"},
    {name:"Катана",  skill_type:"phisic"},
    {name:"Кинжал",  skill_type:"phisic"},
    {name:"Кунаи",  skill_type:"phisic"},
    {name:"Метание сюрикенов",  skill_type:"phisic"},
    {name:"Парные клинки",  skill_type:"phisic"},
    {name:"Рапира",  skill_type:"phisic"},
    {name:"Рукопашный бой",  skill_type:"phisic"},
    {name:"Саи",  skill_type:"phisic"},
    {name:"Следопыт",  skill_type:"phisic"},
    {name:"Стрельба из лука",  skill_type:"phisic"},
    {name:"Тессены",  skill_type:"phisic"},
    {name:"Цзянь",  skill_type:"phisic"}
             ])
end